%Создание полинома
p = [-1.29 -8.21 -4.85 -4.60 -6.27 5.81 6.92 6.83 3.53 5.81 0.11 -6.66];
x = -5.5 : 0.05 : 3;
y = polyval(p , x);

%Нахождение экстремумов через производную
p1 = polyder(p);
r1 = roots(p1);
x01 = r1(imag(r1) == 0);
x01 = sort(x01)
y01 = polyval(p, x01);

%Нахождение экстремумов через функцию поиска минимума
r21 = fminbnd(@f11, -5, -2);

r22 = fminbnd(@f12, -1.5, -0.5);

r23 = fminbnd(@f11, -0.5, 0);

r24 = fminbnd(@f12, 0, 2);

r2 =[r21 r22 r23 r24];
r2 = r2';
r2 = sort(r2)

delta = abs(x01 - r2)
%Вывод: Нахождение экстремумов через производную дает более точный
%результат